# пользователь заходит и начинает общение
# вбивает свой ник с сайта, идет проверка
# если нет, то его перенаправляют на сайт
# если да, то нам нужно взять его номер, пароль от вк
# при начале работы с данными нужно пройтись по пользователям в бд, если None, то пользователь еще не общался, значит беоем ячейку с именем пользователя и вводим туда ноль
# введется файл, где будет идти имя пользователя, его баллы, и на каком задании и в каком состоянии находится задание
# при завершении работы будет запущенна программа, которая будет проходиться по бд, если идет изменение в файле, то пр записывает в бд
